## Pandas

- Series
- Data Frame (2D)
- Panel (3D)

> Used for data analysation

In [1]:
import pandas as pd
pd.__version__

'0.25.1'

## Series

- from list, tuple, dictionary
- from numpy array

In [2]:
import numpy as np

In [3]:
np.array([1,2,3])

array([1, 2, 3])

In [17]:
b = pd.Series([1,2,3])
b

0    1
1    2
2    3
dtype: int64

In [8]:
a = pd.Series([1,2,3], index = ["A","B","C"])
a

A    1
B    2
C    3
dtype: int64

In [10]:
print(a[0])
print(a[0],a["A"])

1
1 1

In [14]:
a["A":"B"]

A    1
B    2
dtype: int64

In [18]:
b.index= ["a","b","c"]

In [16]:
b

a    1
b    2
c    3
dtype: int64

In [19]:
marks = {"English": 85, "Hindi":91, "Science":89}

In [20]:
pd.Series(marks)

English    85
Hindi      91
Science    89
dtype: int64

In [25]:
pd.date_range("2019-12-12","2019-12-23")

DatetimeIndex(['2019-12-12', '2019-12-13', '2019-12-14', '2019-12-15',
               '2019-12-16', '2019-12-17', '2019-12-18', '2019-12-19',
               '2019-12-20', '2019-12-21', '2019-12-22', '2019-12-23'],
              dtype='datetime64[ns]', freq='D')

In [26]:
pd.date_range("2019-12-25",periods = 5)

DatetimeIndex(['2019-12-25', '2019-12-26', '2019-12-27', '2019-12-28',
               '2019-12-29'],
              dtype='datetime64[ns]', freq='D')

In [31]:
temp = pd.Series([28,29,30,31],pd.date_range("2019-11-23",periods = 4))
temp

2019-11-23    28
2019-11-24    29
2019-11-25    30
2019-11-26    31
Freq: D, dtype: int64

In [32]:
b.index

Index(['a', 'b', 'c'], dtype='object')

In [33]:
a.index

Index(['A', 'B', 'C'], dtype='object')

In [39]:
pd.Series(np.arange(10),index = np.random.randint(0,20,10))

2     0
13    1
4     2
9     3
18    4
9     5
13    6
6     7
18    8
13    9
dtype: int32

## DataFrame

- From a dictionary
- From numpy 2d array

In [40]:
marks = {"Names":["Malavika","Sumana","Swapna","Vasishta","Vennela"],
         "Maths":[86,95,87,99,89],
         "English":[91,93,94,93,97],
         "Social":[87,89,76,80,94]}

In [41]:
pd.DataFrame(marks)

      Names  Maths  English  Social
0  Malavika     86       91      87
1    Sumana     95       93      89
2    Swapna     87       94      76
3  Vasishta     99       93      80
4   Vennela     89       97      94

In [44]:
c = np.array([["Sharn",34,54,78],["Sumanth",76,87,98]])
pd.DataFrame(c,columns = ["Name","Maths","English","Social"])

      Name Maths English Social
0    Sharn    34      54     78
1  Sumanth    76      87     98

### pd.read_csv(filename,...)

In [62]:
pd.read_csv("marks.csv")

   Malavika  65  67  78
0     Mohan  56  68  79
1    Sumana  97  85  96
2   Sumanth  68  97  47
3  Vasishta  85  84  75
4   Vennela  76  83  85

In [99]:
df = pd.read_csv("marks.csv",header=0)
df

       Name  Telugu  English  Hindi
0  Malavika      65       67     78
1     Mohan      56       68     79
2    Sumana      97       85     96
3   Sumanth      68       97     47
4  Vasishta      85       84     75
5   Vennela      76       83     85

In [71]:
pd.read_csv("marks.csv",names=["Name","Maths","Science","Social"],usecols=["Name","Maths"]) # Usecols gives the specific rows as result

       Name   Maths
0      Name  Telugu
1  Malavika      65
2     Mohan      56
3    Sumana      97
4   Sumanth      68
5  Vasishta      85
6   Vennela      76

In [72]:
pd.read_csv("marks.csv",header=3)

     Sumana  97    85  96
0   Sumanth  68   NaN  47
1  Vasishta  85  84.0  75
2   Vennela  76  83.0  85

In [73]:
pd.read_csv("marks.csv",usecols=["Name","English"])

       Name  English
0  Malavika     67.0
1     Mohan     68.0
2    Sumana     85.0
3   Sumanth      NaN
4  Vasishta     84.0
5   Vennela     83.0

In [77]:
df["Name"]

0    Malavika
1       Mohan
2      Sumana
3     Sumanth
4    Vasishta
5     Vennela
Name: Name, dtype: object

In [79]:
# In case if the name rewrites as student name 
# if there is a space between the string it doesnt take the whole value as df.student name 
# instead of this we can give it as a single string without spaces i.e., df.studentname

df.Name

0    Malavika
1       Mohan
2      Sumana
3     Sumanth
4    Vasishta
5     Vennela
Name: Name, dtype: object

In [80]:
df[["Name"]]

       Name
0  Malavika
1     Mohan
2    Sumana
3   Sumanth
4  Vasishta
5   Vennela

In [81]:
df[["Name","Hindi"]]

       Name  Hindi
0  Malavika     78
1     Mohan     79
2    Sumana     96
3   Sumanth     47
4  Vasishta     75
5   Vennela     85

In [82]:
df.values

array([['Malavika', 65, 67, 78],
       ['Mohan', 56, 68, 79],
       ['Sumana', 97, 85, 96],
       ['Sumanth', 68, 97, 47],
       ['Vasishta', 85, 84, 75],
       ['Vennela', 76, 83, 85]], dtype=object)

In [83]:
df.columns

Index(['Name', 'Telugu', 'English', 'Hindi'], dtype='object')

In [84]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [85]:
df.dtypes

Name       object
Telugu      int64
English     int64
Hindi       int64
dtype: object

In [86]:
df.shape

(6, 4)

In [87]:
# no.of rows
print(df.shape[0])

# no. of colums
print(df.shape[1])

6
4

### Indexing

- Position based ndexing(iloc)
- Label based indexing(loc)

In [96]:
df

       Name  Telugu  English  Hindi
0  Malavika      65       67     78
1     Mohan      56       68     79
2    Sumana      97       85     96
3   Sumanth      68       97     47
4  Vasishta      85       84     75
5   Vennela      76       83     85

#### df.iloc

In [100]:
df.iloc[4,0:2]

Name      Vasishta
Telugu          85
Name: 4, dtype: object

In [92]:
df.iloc[4:6,:]

       Name  Telugu  English  Hindi
4  Vasishta      85       84     75
5   Vennela      76       83     85

In [93]:
df.iloc[2,3]

96

In [101]:
df.iloc[:,2]

0    67
1    68
2    85
3    97
4    84
5    83
Name: English, dtype: int64

In [105]:
df.iloc[[1,3,4],[0,2]]

       Name  English
1     Mohan       68
3   Sumanth       97
4  Vasishta       84

### loc

In [106]:
df.loc[0,"Name"]

'Malavika'

In [107]:
df.loc[2:4,"Name"]

2      Sumana
3     Sumanth
4    Vasishta
Name: Name, dtype: object

In [109]:
df.loc[2:4,"Name":"Hindi"]

       Name  Telugu  English  Hindi
2    Sumana      97       85     96
3   Sumanth      68       97     47
4  Vasishta      85       84     75

In [111]:
df.loc[2:4,"Telugu":"Name"]

Empty DataFrame
Columns: []
Index: [2, 3, 4]

In [112]:
df.loc[2:4,["Telugu","Name"]]

   Telugu      Name
2      97    Sumana
3      68   Sumanth
4      85  Vasishta

In [113]:
df[["Telugu","English","Name","Hindi"]]

   Telugu  English      Name  Hindi
0      65       67  Malavika     78
1      56       68     Mohan     79
2      97       85    Sumana     96
3      68       97   Sumanth     47
4      85       84  Vasishta     75
5      76       83   Vennela     85

In [114]:
df.set_index("Name")

          Telugu  English  Hindi
Name
Malavika      65       67     78
Mohan         56       68     79
Sumana        97       85     96
Sumanth       68       97     47
Vasishta      85       84     75
Vennela       76       83     85

In [115]:
a = df

In [117]:
a = a.set_index("Name")

In [118]:
a

          Telugu  English  Hindi
Name
Malavika      65       67     78
Mohan         56       68     79
Sumana        97       85     96
Sumanth       68       97     47
Vasishta      85       84     75
Vennela       76       83     85

In [122]:
 a.loc["Malavika","Telugu"]

65

In [124]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name       6 non-null object
Telugu     6 non-null int64
English    6 non-null int64
Hindi      6 non-null int64
dtypes: int64(3), object(1)
memory usage: 320.0+ bytes

In [125]:
a.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Malavika to Vennela
Data columns (total 3 columns):
Telugu     6 non-null int64
English    6 non-null int64
Hindi      6 non-null int64
dtypes: int64(3)
memory usage: 352.0+ bytes

In [126]:
df["Total"] = df["Telugu"]+df["English"]+df["Hindi"]

In [127]:
df["Total"]

0    210
1    203
2    278
3    212
4    244
5    244
Name: Total, dtype: int64

In [128]:
df

       Name  Telugu  English  Hindi  Total
0  Malavika      65       67     78    210
1     Mohan      56       68     79    203
2    Sumana      97       85     96    278
3   Sumanth      68       97     47    212
4  Vasishta      85       84     75    244
5   Vennela      76       83     85    244

In [133]:
df.sum()

Name       MalavikaMohanSumanaSumanthVasishtaVennela
Telugu                                           447
English                                          484
Hindi                                            460
Total                                           1391
dtype: object

In [130]:
df.iloc[:,1:4].sum(axis = 1) # 1 means column wise

0    210
1    203
2    278
3    212
4    244
5    244
dtype: int64

In [132]:
df

       Name  Telugu  English  Hindi  Total
0  Malavika      65       67     78    210
1     Mohan      56       68     79    203
2    Sumana      97       85     96    278
3   Sumanth      68       97     47    212
4  Vasishta      85       84     75    244
5   Vennela      76       83     85    244

In [135]:
df.describe()

          Telugu    English      Hindi       Total
count   6.000000   6.000000   6.000000    6.000000
mean   74.500000  80.666667  76.666667  231.833333
std    14.788509  11.395906  16.329932   28.736156
min    56.000000  67.000000  47.000000  203.000000
25%    65.750000  71.750000  75.750000  210.500000
50%    72.000000  83.500000  78.500000  228.000000
75%    82.750000  84.750000  83.500000  244.000000
max    97.000000  97.000000  96.000000  278.000000

In [136]:
df

       Name  Telugu  English  Hindi  Total
0  Malavika      65       67     78    210
1     Mohan      56       68     79    203
2    Sumana      97       85     96    278
3   Sumanth      68       97     47    212
4  Vasishta      85       84     75    244
5   Vennela      76       83     85    244

In [137]:
df.describe(include = object)

            Name
count          6
unique         6
top     Vasishta
freq           1

In [139]:
df.describe(include = np.int64)

            Name
count          6
unique         6
top     Vasishta
freq           1

In [207]:
student_df = pd.read_csv("student.csv",names=["Name","College","Course"])

In [208]:
student_df

       Name College  Course
0  Malavika     CRR     ART
1    Sumana    ECET     Luv
2  Vasishta     NAR     Ips
3   Vennela     TIR  Beauty
4    Swapna     KBN  makeup
5     Slemy     FST  Beauty
6    Selshy     LKG   Sleep

Check the
- head
- tail
- shape
- columns
- dtypes
- index
- info
- describe

In [209]:
sd= student_df

In [210]:
sd.head()

       Name College  Course
0  Malavika     CRR     ART
1    Sumana    ECET     Luv
2  Vasishta     NAR     Ips
3   Vennela     TIR  Beauty
4    Swapna     KBN  makeup

In [211]:
sd.tail()

       Name College  Course
2  Vasishta     NAR     Ips
3   Vennela     TIR  Beauty
4    Swapna     KBN  makeup
5     Slemy     FST  Beauty
6    Selshy     LKG   Sleep

In [212]:
sd.shape

(7, 3)

In [213]:
sd.columns

Index(['Name', 'College', 'Course'], dtype='object')

In [214]:
sd.index

RangeIndex(start=0, stop=7, step=1)

In [215]:
sd.dtypes

Name       object
College    object
Course     object
dtype: object

In [216]:
sd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
Name       7 non-null object
College    7 non-null object
Course     7 non-null object
dtypes: object(3)
memory usage: 296.0+ bytes

In [217]:
sd.describe()

          Name College  Course
count        7       7       7
unique       7       7       6
top     Sumana     FST  Beauty
freq         1       1       2

In [218]:
sd.sample(4) # For random selection

      Name College  Course
5    Slemy     FST  Beauty
3  Vennela     TIR  Beauty
6   Selshy     LKG   Sleep
1   Sumana    ECET     Luv

In [219]:
sd.nunique()

Name       7
College    7
Course     6
dtype: int64

In [220]:
sd.College.nunique()

7

In [221]:
sd.Course.value_counts()

Beauty    2
makeup    1
Sleep     1
ART       1
Ips       1
Luv       1
Name: Course, dtype: int64

### Function merge

#### pd.merge

In [260]:
df1 = pd.merge(df,sd,on = "Name",how = "outer") # inner means intersection outer means union
df1

       Name  Telugu  English  Hindi  Total College  Course
0  Malavika    65.0     67.0   78.0  210.0     CRR     ART
1     Mohan    56.0     68.0   79.0  203.0     NaN     NaN
2    Sumana    97.0     85.0   96.0  278.0    ECET     Luv
3   Sumanth    68.0     97.0   47.0  212.0     NaN     NaN
4  Vasishta    85.0     84.0   75.0  244.0     NAR     Ips
5   Vennela    76.0     83.0   85.0  244.0     TIR  Beauty
6    Swapna     NaN      NaN    NaN    NaN     KBN  makeup
7     Slemy     NaN      NaN    NaN    NaN     FST  Beauty
8    Selshy     NaN      NaN    NaN    NaN     LKG   Sleep

In [261]:
pd.merge(df,sd,on = "Name",how = "left") # left dataset values returns i.e., df

       Name  Telugu  English  Hindi  Total College  Course
0  Malavika      65       67     78    210     CRR     ART
1     Mohan      56       68     79    203     NaN     NaN
2    Sumana      97       85     96    278    ECET     Luv
3   Sumanth      68       97     47    212     NaN     NaN
4  Vasishta      85       84     75    244     NAR     Ips
5   Vennela      76       83     85    244     TIR  Beauty

In [262]:
pd.merge(df,sd,on = "Name",how = "right") # right dataset values returns i.e., sd

       Name  Telugu  English  Hindi  Total College  Course
0  Malavika    65.0     67.0   78.0  210.0     CRR     ART
1    Sumana    97.0     85.0   96.0  278.0    ECET     Luv
2  Vasishta    85.0     84.0   75.0  244.0     NAR     Ips
3   Vennela    76.0     83.0   85.0  244.0     TIR  Beauty
4    Swapna     NaN      NaN    NaN    NaN     KBN  makeup
5     Slemy     NaN      NaN    NaN    NaN     FST  Beauty
6    Selshy     NaN      NaN    NaN    NaN     LKG   Sleep

### Booelan or Fancy Indexing

In [263]:
df[df["English"]>80]

       Name  Telugu  English  Hindi  Total
2    Sumana      97       85     96    278
3   Sumanth      68       97     47    212
4  Vasishta      85       84     75    244
5   Vennela      76       83     85    244

In [264]:
df[(df["Hindi"]>70) & (df["Telugu"]>90)]["English"]

2    85
Name: English, dtype: int64

In [265]:
df["English"][(df["Hindi"]>70) & (df["Telugu"]>90)]

2    85
Name: English, dtype: int64

In [266]:
sd[sd["Course"]=="Beauty"]

      Name College  Course
3  Vennela     TIR  Beauty
5    Slemy     FST  Beauty

In [267]:
sd[sd["College"]=="CRR"]["Name"]

0    Malavika
Name: Name, dtype: object

In [268]:
sd[sd["Name"]=="Sumana"]["Course"]

1    Luv
Name: Course, dtype: object

### Sorting

In [269]:
df.sort_values("Hindi")

       Name  Telugu  English  Hindi  Total
3   Sumanth      68       97     47    212
4  Vasishta      85       84     75    244
0  Malavika      65       67     78    210
1     Mohan      56       68     79    203
5   Vennela      76       83     85    244
2    Sumana      97       85     96    278

In [270]:
df.sort_values("Hindi", ascending = False)

       Name  Telugu  English  Hindi  Total
2    Sumana      97       85     96    278
5   Vennela      76       83     85    244
1     Mohan      56       68     79    203
0  Malavika      65       67     78    210
4  Vasishta      85       84     75    244
3   Sumanth      68       97     47    212

In [271]:
df.sort_values("Total", ascending = False)

       Name  Telugu  English  Hindi  Total
2    Sumana      97       85     96    278
4  Vasishta      85       84     75    244
5   Vennela      76       83     85    244
3   Sumanth      68       97     47    212
0  Malavika      65       67     78    210
1     Mohan      56       68     79    203

In [272]:
df.sort_values("Name")

       Name  Telugu  English  Hindi  Total
0  Malavika      65       67     78    210
1     Mohan      56       68     79    203
2    Sumana      97       85     96    278
3   Sumanth      68       97     47    212
4  Vasishta      85       84     75    244
5   Vennela      76       83     85    244

In [273]:
sd

       Name College  Course
0  Malavika     CRR     ART
1    Sumana    ECET     Luv
2  Vasishta     NAR     Ips
3   Vennela     TIR  Beauty
4    Swapna     KBN  makeup
5     Slemy     FST  Beauty
6    Selshy     LKG   Sleep

In [274]:
df1

       Name  Telugu  English  Hindi  Total College  Course
0  Malavika    65.0     67.0   78.0  210.0     CRR     ART
1     Mohan    56.0     68.0   79.0  203.0     NaN     NaN
2    Sumana    97.0     85.0   96.0  278.0    ECET     Luv
3   Sumanth    68.0     97.0   47.0  212.0     NaN     NaN
4  Vasishta    85.0     84.0   75.0  244.0     NAR     Ips
5   Vennela    76.0     83.0   85.0  244.0     TIR  Beauty
6    Swapna     NaN      NaN    NaN    NaN     KBN  makeup
7     Slemy     NaN      NaN    NaN    NaN     FST  Beauty
8    Selshy     NaN      NaN    NaN    NaN     LKG   Sleep

In [277]:
df1.sort_values("Name")

       Name  Telugu  English  Hindi  Total College  Course
0  Malavika    65.0     67.0   78.0  210.0     CRR     ART
1     Mohan    56.0     68.0   79.0  203.0     NaN     NaN
8    Selshy     NaN      NaN    NaN    NaN     LKG   Sleep
7     Slemy     NaN      NaN    NaN    NaN     FST  Beauty
2    Sumana    97.0     85.0   96.0  278.0    ECET     Luv
3   Sumanth    68.0     97.0   47.0  212.0     NaN     NaN
6    Swapna     NaN      NaN    NaN    NaN     KBN  makeup
4  Vasishta    85.0     84.0   75.0  244.0     NAR     Ips
5   Vennela    76.0     83.0   85.0  244.0     TIR  Beauty

## Missing Values

In [279]:
df1.isnull()

    Name  Telugu  English  Hindi  Total  College  Course
0  False   False    False  False  False    False   False
1  False   False    False  False  False     True    True
2  False   False    False  False  False    False   False
3  False   False    False  False  False     True    True
4  False   False    False  False  False    False   False
5  False   False    False  False  False    False   False
6  False    True     True   True   True    False   False
7  False    True     True   True   True    False   False
8  False    True     True   True   True    False   False

In [280]:
df1.isna()

    Name  Telugu  English  Hindi  Total  College  Course
0  False   False    False  False  False    False   False
1  False   False    False  False  False     True    True
2  False   False    False  False  False    False   False
3  False   False    False  False  False     True    True
4  False   False    False  False  False    False   False
5  False   False    False  False  False    False   False
6  False    True     True   True   True    False   False
7  False    True     True   True   True    False   False
8  False    True     True   True   True    False   False

In [281]:
df1.isnull().sum()

Name       0
Telugu     3
English    3
Hindi      3
Total      3
College    2
Course     2
dtype: int64

In [286]:
df1

       Name  Telugu  English  Hindi  Total College  Course
0  Malavika    65.0     67.0   78.0  210.0     CRR     ART
1     Mohan    56.0     68.0   79.0  203.0     NaN     NaN
2    Sumana    97.0     85.0   96.0  278.0    ECET     Luv
3   Sumanth    68.0     97.0   47.0  212.0     NaN     NaN
4  Vasishta    85.0     84.0   75.0  244.0     NAR     Ips
5   Vennela    76.0     83.0   85.0  244.0     TIR  Beauty
6    Swapna     NaN      NaN    NaN    NaN     KBN  makeup
7     Slemy     NaN      NaN    NaN    NaN     FST  Beauty
8    Selshy     NaN      NaN    NaN    NaN     LKG   Sleep

In [285]:
print(df1.English.min())
print(df1.English.mean())
print(df1.English.median())
print(df1.English.mode())

67.0
80.66666666666667
83.5
0    67.0
1    68.0
2    83.0
3    84.0
4    85.0
5    97.0
dtype: float64

In [288]:
df1.English.value_counts()

83.0    1
84.0    1
97.0    1
85.0    1
68.0    1
67.0    1
Name: English, dtype: int64

In [292]:
df1["English"].fillna(df["English"].mean(),inplace = True)

In [295]:
df1

       Name  Telugu  English  Hindi  Total College  Course
0  Malavika    65.0     67.0   78.0  210.0     CRR     ART
1     Mohan    56.0     68.0   79.0  203.0     NaN     NaN
2    Sumana    97.0     85.0   96.0  278.0    ECET     Luv
3   Sumanth    68.0     97.0   47.0  212.0     NaN     NaN
4  Vasishta    85.0     84.0   75.0  244.0     NAR     Ips
5   Vennela    76.0     83.0   85.0  244.0     TIR  Beauty
6    Swapna     NaN      NaN    NaN    NaN     KBN  makeup
7     Slemy     NaN      NaN    NaN    NaN     FST  Beauty
8    Selshy     NaN      NaN    NaN    NaN     LKG   Sleep

In [294]:
df1 = pd.merge(df,sd,on = "Name",how = "outer") # inner means intersection outer means union
df1

       Name  Telugu  English  Hindi  Total College  Course
0  Malavika    65.0     67.0   78.0  210.0     CRR     ART
1     Mohan    56.0     68.0   79.0  203.0     NaN     NaN
2    Sumana    97.0     85.0   96.0  278.0    ECET     Luv
3   Sumanth    68.0     97.0   47.0  212.0     NaN     NaN
4  Vasishta    85.0     84.0   75.0  244.0     NAR     Ips
5   Vennela    76.0     83.0   85.0  244.0     TIR  Beauty
6    Swapna     NaN      NaN    NaN    NaN     KBN  makeup
7     Slemy     NaN      NaN    NaN    NaN     FST  Beauty
8    Selshy     NaN      NaN    NaN    NaN     LKG   Sleep

In [296]:
df2 = df1

In [297]:
df2.dropna()

       Name  Telugu  English  Hindi  Total College  Course
0  Malavika    65.0     67.0   78.0  210.0     CRR     ART
2    Sumana    97.0     85.0   96.0  278.0    ECET     Luv
4  Vasishta    85.0     84.0   75.0  244.0     NAR     Ips
5   Vennela    76.0     83.0   85.0  244.0     TIR  Beauty

In [299]:
df2.dropna(axis = 1)

       Name
0  Malavika
1     Mohan
2    Sumana
3   Sumanth
4  Vasishta
5   Vennela
6    Swapna
7     Slemy
8    Selshy

In [301]:
df2.drop("Hindi", axis = 1)

       Name  Telugu  English  Total College  Course
0  Malavika    65.0     67.0  210.0     CRR     ART
1     Mohan    56.0     68.0  203.0     NaN     NaN
2    Sumana    97.0     85.0  278.0    ECET     Luv
3   Sumanth    68.0     97.0  212.0     NaN     NaN
4  Vasishta    85.0     84.0  244.0     NAR     Ips
5   Vennela    76.0     83.0  244.0     TIR  Beauty
6    Swapna     NaN      NaN    NaN     KBN  makeup
7     Slemy     NaN      NaN    NaN     FST  Beauty
8    Selshy     NaN      NaN    NaN     LKG   Sleep

In [302]:
df1

       Name  Telugu  English  Hindi  Total College  Course
0  Malavika    65.0     67.0   78.0  210.0     CRR     ART
1     Mohan    56.0     68.0   79.0  203.0     NaN     NaN
2    Sumana    97.0     85.0   96.0  278.0    ECET     Luv
3   Sumanth    68.0     97.0   47.0  212.0     NaN     NaN
4  Vasishta    85.0     84.0   75.0  244.0     NAR     Ips
5   Vennela    76.0     83.0   85.0  244.0     TIR  Beauty
6    Swapna     NaN      NaN    NaN    NaN     KBN  makeup
7     Slemy     NaN      NaN    NaN    NaN     FST  Beauty
8    Selshy     NaN      NaN    NaN    NaN     LKG   Sleep

In [312]:
df

       Name  Telugu  English  Hindi  Total
0  Malavika      65       67     78    210
1     Mohan      56       68     79    203
2    Sumana      97       85     96    278
3   Sumanth      68       97     47    212
4  Vasishta      85       84     75    244
5   Vennela      76       83     85    244

In [313]:
sd

       Name College  Course
0  Malavika     CRR     ART
1    Sumana    ECET     Luv
2  Vasishta     NAR     Ips
3   Vennela     TIR  Beauty
4    Swapna     KBN  makeup
5     Slemy     FST  Beauty
6    Selshy     LKG   Sleep

In [316]:
df1.drop(1)

       Name  Telugu  English  Hindi  Total College  Course
0  Malavika    65.0     67.0   78.0  210.0     CRR     ART
2    Sumana    97.0     85.0   96.0  278.0    ECET     Luv
3   Sumanth    68.0     97.0   47.0  212.0     NaN     NaN
4  Vasishta    85.0     84.0   75.0  244.0     NAR     Ips
5   Vennela    76.0     83.0   85.0  244.0     TIR  Beauty
6    Swapna     NaN      NaN    NaN    NaN     KBN  makeup
7     Slemy     NaN      NaN    NaN    NaN     FST  Beauty
8    Selshy     NaN      NaN    NaN    NaN     LKG   Sleep

In [317]:
final_df = pd.merge(df,sd, on = "Name", how = "outer")

In [318]:
final_df

       Name  Telugu  English  Hindi  Total College  Course
0  Malavika    65.0     67.0   78.0  210.0     CRR     ART
1     Mohan    56.0     68.0   79.0  203.0     NaN     NaN
2    Sumana    97.0     85.0   96.0  278.0    ECET     Luv
3   Sumanth    68.0     97.0   47.0  212.0     NaN     NaN
4  Vasishta    85.0     84.0   75.0  244.0     NAR     Ips
5   Vennela    76.0     83.0   85.0  244.0     TIR  Beauty
6    Swapna     NaN      NaN    NaN    NaN     KBN  makeup
7     Slemy     NaN      NaN    NaN    NaN     FST  Beauty
8    Selshy     NaN      NaN    NaN    NaN     LKG   Sleep

In [320]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9 entries, 0 to 8
Data columns (total 7 columns):
Name       9 non-null object
Telugu     6 non-null float64
English    6 non-null float64
Hindi      6 non-null float64
Total      6 non-null float64
College    7 non-null object
Course     7 non-null object
dtypes: float64(4), object(3)
memory usage: 576.0+ bytes

In [323]:
final_df.isnull()

    Name  Telugu  English  Hindi  Total  College  Course
0  False   False    False  False  False    False   False
1  False   False    False  False  False     True    True
2  False   False    False  False  False    False   False
3  False   False    False  False  False     True    True
4  False   False    False  False  False    False   False
5  False   False    False  False  False    False   False
6  False    True     True   True   True    False   False
7  False    True     True   True   True    False   False
8  False    True     True   True   True    False   False

In [322]:
final_df.isnull().sum()

Name       0
Telugu     3
English    3
Hindi      3
Total      3
College    2
Course     2
dtype: int64

In [324]:
final_df.columns

Index(['Name', 'Telugu', 'English', 'Hindi', 'Total', 'College', 'Course'], dtype='object')

In [325]:
final_df.dtypes

Name        object
Telugu     float64
English    float64
Hindi      float64
Total      float64
College     object
Course      object
dtype: object

In [328]:
final_df.dtypes != object

Name       False
Telugu      True
English     True
Hindi       True
Total       True
College    False
Course     False
dtype: bool

In [333]:
final_df.columns[final_df.dtypes != object]

Index(['Telugu', 'English', 'Hindi', 'Total'], dtype='object')

In [331]:
final_df.describe()

          Telugu    English      Hindi       Total
count   6.000000   6.000000   6.000000    6.000000
mean   74.500000  80.666667  76.666667  231.833333
std    14.788509  11.395906  16.329932   28.736156
min    56.000000  67.000000  47.000000  203.000000
25%    65.750000  71.750000  75.750000  210.500000
50%    72.000000  83.500000  78.500000  228.000000
75%    82.750000  84.750000  83.500000  244.000000
max    97.000000  97.000000  96.000000  278.000000

In [332]:
final_df.describe().columns

Index(['Telugu', 'English', 'Hindi', 'Total'], dtype='object')

In [334]:
final_df.describe(include = object).columns

Index(['Name', 'College', 'Course'], dtype='object')

### Numerical Columns

In [352]:
cat_cols = final_df.describe(include = object).columns
num_cols = final_df.columns[final_df.dtypes != object]

In [353]:
print(cat_cols)
print(num_cols)

Index(['Name', 'College', 'Course'], dtype='object')
Index(['Telugu', 'English', 'Hindi', 'Total'], dtype='object')

In [354]:
print(final_df.College.mode())

0     CRR
1    ECET
2     FST
3     KBN
4     LKG
5     NAR
6     TIR
dtype: object

In [355]:
for col in num_cols:
    final_df[col].fillna(final_df[col].mean(),inplace = True)

In [356]:
final_df

       Name  Telugu    English      Hindi       Total College  Course
0  Malavika    65.0  67.000000  78.000000  210.000000     CRR     ART
1     Mohan    56.0  68.000000  79.000000  203.000000     NaN     NaN
2    Sumana    97.0  85.000000  96.000000  278.000000    ECET     Luv
3   Sumanth    68.0  97.000000  47.000000  212.000000     NaN     NaN
4  Vasishta    85.0  84.000000  75.000000  244.000000     NAR     Ips
5   Vennela    76.0  83.000000  85.000000  244.000000     TIR  Beauty
6    Swapna    74.5  80.666667  76.666667  231.833333     KBN  makeup
7     Slemy    74.5  80.666667  76.666667  231.833333     FST  Beauty
8    Selshy    74.5  80.666667  76.666667  231.833333     LKG   Sleep

In [358]:
for col in cat_cols:
    final_df[col].fillna(final_df[col].mode()[0],inplace=True)

In [362]:
final_df["College"][final_df["College"].isna()]

       Name  Telugu    English      Hindi       Total College  Course
0  Malavika    65.0  67.000000  78.000000  210.000000     CRR     ART
1     Mohan    56.0  68.000000  79.000000  203.000000     CRR  Beauty
2    Sumana    97.0  85.000000  96.000000  278.000000    ECET     Luv
3   Sumanth    68.0  97.000000  47.000000  212.000000     CRR  Beauty
4  Vasishta    85.0  84.000000  75.000000  244.000000     NAR     Ips
5   Vennela    76.0  83.000000  85.000000  244.000000     TIR  Beauty
6    Swapna    74.5  80.666667  76.666667  231.833333     KBN  makeup
7     Slemy    74.5  80.666667  76.666667  231.833333     FST  Beauty
8    Selshy    74.5  80.666667  76.666667  231.833333     LKG   Sleep

In [350]:
final_df["College"]mode()[0]

'CRR'

###  Grouping

In [374]:
final_df.groupby('College')["Telugu"].sum()

College
CRR     189.0
ECET     97.0
FST      74.5
KBN      74.5
LKG      74.5
NAR      85.0
TIR      76.0
Name: Telugu, dtype: float64

In [375]:
final_df.groupby("College").Hindi.sum()

College
CRR     204.000000
ECET     96.000000
FST      76.666667
KBN      76.666667
LKG      76.666667
NAR      75.000000
TIR      85.000000
Name: Hindi, dtype: float64

In [376]:
final_df.groupby("College").sum()

         Telugu     English       Hindi       Total
College
CRR       189.0  232.000000  204.000000  625.000000
ECET       97.0   85.000000   96.000000  278.000000
FST        74.5   80.666667   76.666667  231.833333
KBN        74.5   80.666667   76.666667  231.833333
LKG        74.5   80.666667   76.666667  231.833333
NAR        85.0   84.000000   75.000000  244.000000
TIR        76.0   83.000000   85.000000  244.000000

In [378]:
final_df.groupby("College")[["Telugu","Hindi"]].max()

         Telugu      Hindi
College
CRR        68.0  79.000000
ECET       97.0  96.000000
FST        74.5  76.666667
KBN        74.5  76.666667
LKG        74.5  76.666667
NAR        85.0  75.000000
TIR        76.0  85.000000

In [380]:
final_df.groupby(["College","Course"]).Telugu.max()

College  Course
CRR      ART       65.0
         Beauty    68.0
ECET     Luv       97.0
FST      Beauty    74.5
KBN      makeup    74.5
LKG      Sleep     74.5
NAR      Ips       85.0
TIR      Beauty    76.0
Name: Telugu, dtype: float64

In [381]:
final_df.groupby(["Course","College"]).Telugu.max()

Course  College
ART     CRR        65.0
Beauty  CRR        68.0
        FST        74.5
        TIR        76.0
Ips     NAR        85.0
Luv     ECET       97.0
Sleep   LKG        74.5
makeup  KBN        74.5
Name: Telugu, dtype: float64